Octopus/InformationRegisters/vrgЦеныНоменклатурыМобильныеСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>vrgЦеныНоменклатурыМобильныеСклад</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ) Тип цен по умолчанию для оформления документов по данному договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/InformationRegisters/vrgОстаткиНаСкладахМобильныеСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>vrgОстаткиНаСкладахМобильныеСклад</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/InformationRegisters/vrgОстаткиЗаказовПоставщикамМобильные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>vrgОстаткиЗаказовПоставщикамМобильные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/Enums/РежимЗагрузкиКартинок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>РежимЗагрузкиКартинок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Загружать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагружатьНезагруженные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагружать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучатьОнлайн</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Octopus/Enums/МоделиТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>МоделиТСД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Caribe_PL_40L</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Caribe_PL_45L</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Caribe_PL_55L</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LTP_83</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Newland_MT65_Beluga</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Newland_MT90</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Symbol_MC40</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sunmi_L2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Urovo_i6300</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Urovo_i6310</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Zebra_TC21</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУказана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучныеНастройки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Octopus/Documents/vrgИнвентаризацияМобильная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>vrgИнвентаризацияМобильная</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданНаМобильномУстройстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этикетка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Octopus/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Octopus/Documents/vrgУниверсальныйДокументМобильный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>vrgУниверсальныйДокументМобильный</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданНаМобильномУстройстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отобран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Отсканировано</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Octopus/CommonModules/Разработка/Ext/Module.bsl
Процедура ПроверитьЗаполнениеОсновныхКонстант() Экспорт
	
	Если Не ЗначениеЗаполнено(Константы.АдресПодключенияКБазе.Получить()) Тогда
		Константы.АдресПодключенияКБазе.Установить("http://vr-task.com:8088/UTP1_2");
		Если Не ЗначениеЗаполнено(Константы.ИмяПользователяДляПодключенияКБазе.Получить()) Тогда
			Константы.ИмяПользователяДляПодключенияКБазе.Установить("PortableDataTerminal");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Константы.ПарольПользователяДляПодключенияКБазе.Получить()) Тогда
			Константы.ПарольПользователяДляПодключенияКБазе.Установить("");
		КонецЕсли;
		Константы.ОбновлятьРегистрыСведенийПриОбмене.Установить(Истина);
	КонецЕсли;

	//Если Не ЗначениеЗаполнено(Константы.ПрефиксНумерацииДокументов.Получить()) Тогда
	//	СообщитьПользователю("Внимание! Не установлен префикс нумерации документов, номера могут быть неуникальными!");
	//КонецЕсли;

	Если Не ЗначениеЗаполнено(Константы.РежимОбновленияКартинок.Получить()) Тогда
		Константы.РежимОбновленияКартинок.Установить(Перечисления.РежимЗагрузкиКартинок.НеЗагружать);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Константы.МодельТСД.Получить()) Тогда
		Константы.МодельТСД.Установить(Перечисления.МоделиТСД.НеУказана);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнениеПланаОбмена() Экспорт
	
	НайденныйГлавныйУзел = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду("Г");
	Если Не ЗначениеЗаполнено(НайденныйГлавныйУзел) Тогда
		НовыйУзел = ПланыОбмена.vrgМобильныеСклад.СоздатьУзел();
		НовыйУзел.Код = "Г";
		НовыйУзел.Наименование = "Головна база";
		НовыйУзел.Записать();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Константы.УзелЦентральнойБазы.Получить()) Тогда
		Константы.УзелЦентральнойБазы.Установить(ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду("Г"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код) Тогда
		Сообщить("Увага! Встановіть код поточної бази в плані обміну, без цього обмін з основною базою неможливий!");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекущийПрефикс() Экспорт
	
	ТекПрефиксНумерацииДокументов = Константы.ПрефиксНумерацииДокументов.Получить();
	Если Не ЗначениеЗаполнено(ТекПрефиксНумерацииДокументов) Тогда
		ТекПрефиксНумерацииДокументов = "АА";
	КонецЕсли;
	
	МесяцСтрока = СокрЛП(Месяц(ТекущаяДата()));
	ДеньСтрока = СокрЛП(День(ТекущаяДата()));

	МесяцСтрока = ?(СтрДлина(МесяцСтрока) = 1, "0", "") + МесяцСтрока;
	ДеньСтрока = ?(СтрДлина(ДеньСтрока) = 1, "0", "") + ДеньСтрока;

	ТекПрефиксНумерацииДокументов = ТекПрефиксНумерацииДокументов + ДеньСтрока + МесяцСтрока;

	Возврат ТекПрефиксНумерацииДокументов;

КонецФункции

Функция URIПространстваИменСервиса() Экспорт

	Возврат "http://www.1c.ru/SB/MobileExchange";

КонецФункции

Функция ПолучитьПрокси(СообщатьОбОшибках = Истина, ИмяОперации = Неопределено) Экспорт

	Адрес = Константы.АдресПодключенияКБазе.Получить();
	Пользователь = Константы.ИмяПользователяДляПодключенияКБазе.Получить();
	Пароль = Константы.ПарольПользователяДляПодключенияКБазе.Получить();

	Если НЕ ЗначениеЗаполнено(Адрес) Тогда
		Если СообщатьОбОшибках Тогда
			Сообщить("Не заповнено адресу підключення до стаціонарної бази.");
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Адрес = Адрес + "/ws/vrgroupmobile.1cws?wsdl";
		Определения = Новый WSОпределения(Адрес, Пользователь, Пароль);

		Прокси = Новый WSПрокси(Определения, "http://www.1c.ru/SB/MobileExchange", "vrgPortableDataTerminalExchange", "vrgPortableDataTerminalExchangeSoap", , 40*60);
		Прокси.Пользователь = Пользователь;
		Прокси.Пароль = Пароль;
	Исключение
		Если СообщатьОбОшибках Тогда
			Сообщить(?(ЗначениеЗаполнено(ИмяОперации),"["+ИмяОперации+"] ","") + "Не вдалося встановити WS-з'єднання зі стаціонарною базою.
			|Перевірте підключення до інтернету");
		КонецЕсли;
		Возврат Неопределено;
	КонецПопытки;

	Возврат Прокси;

КонецФункции

Функция НуженПереносДанных(Данные, УзелОбмена) Экспорт
	
	// В данном случае, переносятся все данные
	Возврат Истина;
	
КонецФункции

Процедура УдалениеДанных(Данные)

	// Получаем объект описания метаданного, соответствующий данным
	ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());
	// Проверяем тип, интересуют только те типы, которые реализованы на мобильной платформе
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда

		// Перенос удаления объекта для объектных
		Данные = Новый УдалениеОбъекта(Данные.Ссылка);

	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.Последовательности.Содержит(ОбъектМетаданных) Тогда

		// Очищаем данные
		Данные.Очистить();

	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьДанные(ЗаписьXML, Данные) Экспорт

	ЗаписатьXML(ЗаписьXML, Данные);

КонецПроцедуры

Функция ЗагрузитьДанныеНаМобильноеУстройство() Экспорт

	Прокси = ПолучитьПрокси();

	ХранилищеПолученныхДанных = Прокси.ПолучитьДанные(ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код);

	//Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ХранилищеПолученныхДанных.Получить());

		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель,ЧтениеСообщения.НомерПринятого);

		НачатьТранзакцию();
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
			
			Данные = ПрочитатьXML(ЧтениеXML);
			
			Если Не Данные = Неопределено Тогда
				
				//Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;
				Данные.ОбменДанными.Загрузка = Истина;
				
				Данные.Записать();
			
			КонецЕсли;
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		
		ЧтениеСообщения.ЗакончитьЧтение();
		ЧтениеXML.Закрыть();
	//Исключение
	//	#Если Клиент Тогда
	//	Сообщить("Неудачная попытка чтения данных обмена по причине: " + ОписаниеОшибки());
	//	#КонецЕсли
	//КонецПопытки;

	ВыполнитьУдалениеСтарыхДокументовВФоновомРежиме();

	Возврат Истина;

КонецФункции

Функция ВыгрузитьДанныеСМобильногоУстройства() Экспорт

	УзелОбмена = Константы.УзелЦентральнойБазы.Получить();
	Прокси = ПолучитьПрокси();

	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);

	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");

	ТипДанныхУдаления = Тип("УдалениеОбъекта");

	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл

		Данные = ВыборкаИзменений.Получить();

		// Если перенос данных не нужен, то, возможно, необходимо записать удаление данных
		Если Не НуженПереносДанных(Данные, УзелОбмена) Тогда

			// Получаем значение с возможным удалением данных
			УдалениеДанных(Данные);

		КонецЕсли;	

		// Записываем данные в сообщение
		ЗаписатьДанные(ЗаписьXML, Данные);

	КонецЦикла;

	ЗаписьСообщения.ЗакончитьЗапись();

	ДанныеОбмена = Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));

	Прокси.ЗаписатьДанные(ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код, ДанныеОбмена);

	Возврат Истина;

КонецФункции

Функция ВыполнитьОбменДанными() Экспорт

	УзелОбмена = Константы.УзелЦентральнойБазы.Получить();
	Прокси = ПолучитьПрокси(Истина, "Обмен данными");
	Если Прокси = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);

	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");

	ТипДанныхУдаления = Тип("УдалениеОбъекта");

	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл

		Данные = ВыборкаИзменений.Получить();

		// Если перенос данных не нужен, то, возможно, необходимо записать удаление данных
		Если Не НуженПереносДанных(Данные, УзелОбмена) Тогда

			// Получаем значение с возможным удалением данных
			УдалениеДанных(Данные);

		КонецЕсли;	

		// Записываем данные в сообщение
		ЗаписатьДанные(ЗаписьXML, Данные);

	КонецЦикла;

	ЗаписьСообщения.ЗакончитьЗапись();

	ДанныеОбмена = Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));

	ИдентификаторУстройства = Константы.ИдентификаторУстройства.Получить();
	КодУстройства = ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код;
	ОбновлятьРегистрыСведений = Константы.ОбновлятьРегистрыСведенийПриОбмене.Получить();
	ХранилищеПолученныхДанных = Прокси.ВыполнитьОбменДанными(КодУстройства, ИдентификаторУстройства, ДанныеОбмена, ОбновлятьРегистрыСведений);

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ХранилищеПолученныхДанных.Получить());

	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель,ЧтениеСообщения.НомерПринятого);

	НачатьТранзакцию();
	Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
		
		Данные = ПрочитатьXML(ЧтениеXML);
		
		Если Не Данные = Неопределено Тогда
			
			//Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;
			Данные.ОбменДанными.Загрузка = Истина;
			
			Данные.Записать();
		
		КонецЕсли;
		
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
	ЧтениеСообщения.ЗакончитьЧтение();
	ЧтениеXML.Закрыть();

	ВыполнитьУдалениеСтарыхДокументовВФоновомРежиме();

	Возврат Истина;

КонецФункции

Функция ВыполнитьНачальнуюИнициализациюДляМобильногоУстройства() Экспорт

	Прокси = ПолучитьПрокси();

	ХранилищеПолученныхДанных = Прокси.ВыполнитьНачальнуюИнициализацию(ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код);

	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ХранилищеПолученныхДанных.Получить());

		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель,ЧтениеСообщения.НомерПринятого);

		НачатьТранзакцию();
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл

			Данные = ПрочитатьXML(ЧтениеXML);

			Если Не Данные = Неопределено Тогда
				Данные.ОбменДанными.Загрузка = Истина;
				Данные.Записать();
			КонецЕсли;

		КонецЦикла;
		ЗафиксироватьТранзакцию();

		ЧтениеСообщения.ЗакончитьЧтение();
		ЧтениеXML.Закрыть();
		Сообщить("Початкову ініціалізацію пристрою успішно завершено!");
		
		//+NovashIV_20.01.2023
		Ответ = ЛицензированиеСервер.ЗарегистрироватьЛицензиюОтправитьДанныеНаСервер(Константы.ИдентификаторУстройства.Получить(),Константы.Имя_Лицензии.Получить(),Константы.Телефон_Лицензии.Получить(),Константы.EMail_Лицензии.Получить(),Константы.Комментарий_Лицензии.Получить());
		//-NovashIV_20.01.2023
	
	Исключение
		Сообщить("Не вдалося виконати початкову ініціалізацію з причини: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

Функция ПолучитьЦену(Номенклатура, ЕдиницаИзмерения, ТипЦен, ХарактеристикаНоменклатуры) Экспорт

	ЗапросЦены = Новый Запрос;
	ЗапросЦены.УстановитьПараметр("Номенклатура", Номенклатура);
	ЗапросЦены.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	ЗапросЦены.УстановитьПараметр("ТипЦен", ТипЦен);
	ЗапросЦены.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныНоменклатурыМобильныеСклад.Цена КАК Цена,
	|	ЦеныНоменклатурыМобильныеСклад.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.vrgЦеныНоменклатурыМобильныеСклад КАК ЦеныНоменклатурыМобильныеСклад
	|ГДЕ
	|	ЦеныНоменклатурыМобильныеСклад.Номенклатура = &Номенклатура
	|	И ЦеныНоменклатурыМобильныеСклад.ТипЦен = &ТипЦен
	|	И ЦеныНоменклатурыМобильныеСклад.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|";
	ВыборкаЦены = ЗапросЦены.Выполнить().Выбрать();
	Цена = 0;
	Если ВыборкаЦены.Следующий() Тогда
		Цена = ПересчитатьЦенуПриИзмененииЕдиницы(ВыборкаЦены.Цена, ВыборкаЦены.ЕдиницаИзмерения, ЕдиницаИзмерения);
	КонецЕсли;
	Возврат Цена;

КонецФункции

Функция ПересчитатьЦенуПриИзмененииЕдиницы(Знач Цена, Знач ЕдиницаЦены, Знач НоваяЕдиница) Экспорт

	НовоеЗначениеЦены = Цена;

	Если ЕдиницаЦены <> НоваяЕдиница Тогда
		Если НЕ ЗначениеЗаполнено(НоваяЕдиница) Тогда // параметр единицы не задан, значить надо возвращать в единице цены
			Если НЕ ЗначениеЗаполнено(ЕдиницаЦены) Тогда // если не задана единица цены, то будем счатать цену нулевой
				НовоеЗначениеЦены = 0;
			Иначе
				НоваяЕдиница = ЕдиницаЦены;
			КонецЕсли;
		Иначе // если единица цены не совпадает с параметром, то надо пересчитать
			Если НЕ ЗначениеЗаполнено(ЕдиницаЦены) Тогда // если не задана единица цены, то будем счатать цену нулевой
				НовоеЗначениеЦены = 0;
			Иначе
				КоэффициентЦены = ЕдиницаЦены.Коэффициент;
				НовоеЗначениеЦены  = ?(НЕ ЗначениеЗаполнено(КоэффициентЦены), 0, 
									 НовоеЗначениеЦены * НоваяЕдиница.Коэффициент / КоэффициентЦены)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат НовоеЗначениеЦены;

КонецФункции

Функция ПолучитьОстаток(Номенклатура, Склад, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения = Неопределено) Экспорт

	НаборЗаписей = РегистрыСведений.vrgОстаткиНаСкладахМобильныеСклад.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Отбор.Склад.Установить(Склад);
	НаборЗаписей.Отбор.СерияНоменклатуры.Установить(СерияНоменклатуры);
	НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(ХарактеристикаНоменклатуры);
	НаборЗаписей.Прочитать();

	ТекОстаток = 0;
	Если НаборЗаписей.Количество() > 0 Тогда
		ТекОстаток = НаборЗаписей[0].Количество;
	КонецЕсли;

	Если ЕдиницаИзмерения <> Неопределено И Номенклатура.ЕдиницаХраненияОстатков <> ЕдиницаИзмерения Тогда
		ТекОстаток = ТекОстаток * Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ?(ЕдиницаИзмерения.Коэффициент=0,1,ЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	Возврат ТекОстаток;

КонецФункции

Функция Пинг() Экспорт

	Прокси = ПолучитьПрокси();

	Результат = Прокси.Пинг(ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код);
	Возврат Результат;

КонецФункции

Функция ПолучитьТекущегоПользователя() Экспорт
	
	Возврат Константы.ПользовательПоУмолчанию.Получить();
	
КонецФункции

Процедура ПроверитьДублиСтрок(ТабЧасть, Отказ) Экспорт

	ВремТаблица = ТабЧасть.Выгрузить();
	ВремТаблица.Колонки.Добавить("КоличествоПовторений");
	ВремТаблица.ЗаполнитьЗначения(1, "КоличествоПовторений");
	
	ВремТаблица.Свернуть("Номенклатура", "КоличествоПовторений");
	
	Для Каждого Строка Из ВремТаблица Цикл
		
		Если Строка.КоличествоПовторений > 1 Тогда
			Сообщить("Номенклатура " + Строка.Номенклатура + " зустрічається більше, ніж в одному рядку!");
			Отказ = Истина
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьУдалениеСтарыхДокументовВФоновомРежиме() Экспорт

	ИскомоеФЗ = Новый Структура("Наименование, Состояние", "УдалениеСтарыхДокументов", СостояниеФоновогоЗадания.Активно);
	МассивФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ИскомоеФЗ);
	МожноЗапускать = МассивФЗ.Количество() = 0;

	Если НЕ МожноЗапускать Тогда
		Возврат;
	КонецЕсли;

	ФЗ = ФоновыеЗадания.Выполнить("Разработка.ВыполнитьУдалениеСтарыхДокументов", , , "УдалениеСтарыхДокументов");

КонецПроцедуры

Процедура ВыполнитьУдалениеСтарыхДокументов() Экспорт

	КоличествоДнейХранения = Константы.КоличествоДнейХраненияДокументовНаУстройстве.Получить();
	Если КоличествоДнейХранения = 0 Тогда
		Возврат;
	КонецЕсли;

	ДатаСохранения = НачалоДня(ТекущаяДата()) - КоличествоДнейХранения*24*60*60;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСохранения", ДатаСохранения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнвентаризацияМобильная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.vrgИнвентаризацияМобильная КАК ИнвентаризацияМобильная
	|ГДЕ
	|	ИнвентаризацияМобильная.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.ДатаПоступления < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМобильное.Ссылка
	|ИЗ
	|	Документ.vrgПоступлениеМобильное КАК ПоступлениеМобильное
	|ГДЕ
	|	ПоступлениеМобильное.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходныйОрдерМобильный.Ссылка
	|ИЗ
	|	Документ.vrgРасходныйОрдерМобильный КАК РасходныйОрдерМобильный
	|ГДЕ
	|	РасходныйОрдерМобильный.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйОрдерМобильный.Ссылка
	|ИЗ
	|	Документ.vrgПриходныйОрдерМобильный КАК ПриходныйОрдерМобильный
	|ГДЕ
	|	ПриходныйОрдерМобильный.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.vrgПеремещениеМобильное КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратПоставщикуМобильный.Ссылка
	|ИЗ
	|	Документ.vrgВозвратПоставщикуМобильный КАК ВозвратПоставщикуМобильный
	|ГДЕ
	|	ВозвратПоставщикуМобильный.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратМобильный.Ссылка
	|ИЗ
	|	Документ.vrgВозвратМобильный КАК ВозвратМобильный
	|ГДЕ
	|	ВозвратМобильный.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияМобильная.Ссылка
	|ИЗ
	|	Документ.vrgРеализацияМобильная КАК РеализацияМобильная
	|ГДЕ
	|	РеализацияМобильная.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеМобильное.Ссылка
	|ИЗ
	|	Документ.vrgСписаниеМобильное КАК СписаниеМобильное
	|ГДЕ
	|	СписаниеМобильное.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщикуМобильный.Ссылка
	|ИЗ
	|	Документ.vrgЗаказПоставщикуМобильный КАК ЗаказПоставщикуМобильный
	|ГДЕ
	|	ЗаказПоставщикуМобильный.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаМобильный.Ссылка
	|ИЗ
	|	Документ.vrgЗаказКлиентаМобильный КАК ЗаказКлиентаМобильный
	|ГДЕ
	|	ЗаказКлиентаМобильный.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОприходованиеМобильное.Ссылка
	|ИЗ
	|	Документ.vrgОприходованиеМобильное КАК ОприходованиеМобильное
	|ГДЕ
	|	ОприходованиеМобильное.Дата < &ДатаСохранения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УниверсальныйДокументМобильный.Ссылка
	|ИЗ
	|	Документ.vrgУниверсальныйДокументМобильный КАК УниверсальныйДокументМобильный
	|ГДЕ
	|	УниверсальныйДокументМобильный.Дата < &ДатаСохранения
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Выборка.Ссылка.ПолучитьОбъект().Удалить();
	КонецЦикла;

	ПланыОбмена.УдалитьРегистрациюИзменений(ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду("Г"));

КонецПроцедуры

Функция ИзменитьПараметрыНоменклатуры(СтруктураПараметров) Экспорт

	ТекстОшибки = "";
	РезультатОбмена = Истина;
	Прокси = ПолучитьПрокси();
	Если Прокси = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДанныеОбмена = Прокси.ИзменитьПараметрыНоменклатуры(ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код,
													СериализаторJSON(СтруктураПараметров),
													ТекстОшибки);

	НазваниеПроцедуры = "[Изменение параметров номенклатуры] ";
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Сообщить(НазваниеПроцедуры + ТекстОшибки);
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());

		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель,ЧтениеСообщения.НомерПринятого);

		НоменклатураСсылка = Неопределено;
		НачатьТранзакцию();
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
			Данные = ПрочитатьXML(ЧтениеXML);
			Если Не Данные = Неопределено Тогда
				Данные.Записать();
				Если ТипЗнч(Данные) = Тип("СправочникОбъект.Номенклатура") Тогда
					НоменклатураСсылка = Данные.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		ЧтениеСообщения.ЗакончитьЧтение();
		ЧтениеXML.Закрыть();
		Возврат НоменклатураСсылка;
	Исключение
		ТекстОшибки = ТекстОшибки + ОписаниеОшибки();
	КонецПопытки;

	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Сообщить(НазваниеПроцедуры + ТекстОшибки);
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьКартинкуНоменклатуры(Номенклатура, ПолучатьОнлайн = Ложь) Экспорт

	ТекстОшибки = "";
	Прокси = ПолучитьПрокси();
	Если Прокси = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		ХранилищеПолученныхДанных = Прокси.ПолучитьКартинкуНоменклатуры(ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код, СериализаторJSON(Номенклатура), ПолучатьОнлайн, ТекстОшибки);
	Исключение
	КонецПопытки;

	НазваниеПроцедуры = "[Обновление картинки номенклатуры] ";
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Сообщить(НазваниеПроцедуры + ТекстОшибки);
		Возврат Неопределено;
	КонецЕсли;

	ДанныеХранилища = ХранилищеПолученныхДанных.Получить();

	Если ПолучатьОнлайн Тогда
		Возврат ДанныеХранилища;
	Иначе
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ДанныеХранилища);
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
			Данные = ПрочитатьXML(ЧтениеXML);
			Если Не Данные = Неопределено Тогда
				Данные.Записать();
			КонецЕсли;
		КонецЦикла;
		ЧтениеXML.Закрыть();
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция СериализаторJSON(ДанныеВходные) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,ДанныеВходные,НазначениеТипаXML.Явное);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Возврат СтрокаJSON;

КонецФункции

Функция ДесерилиазаторJSON(ДанныеВходные) Экспорт

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеВходные);
	ДанныеВозврат = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Возврат ДанныеВозврат;

КонецФункции

Функция ПолучитьСтруктуруНастроекСканирования() Экспорт

	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("МодельТСД", Константы.МодельТСД.Получить());
	СтруктураНастроек.Вставить("ИмяСобытияСканирования", СокрЛП(Константы.ИмяСобытияСканирования.Получить()));
	СтруктураНастроек.Вставить("ИмяПоляШтрихкода", СокрЛП(Константы.ИмяПоляШтрихкода.Получить()));

	Возврат СтруктураНастроек;

КонецФункции

Функция ОбновитьЦеныНоменклатуры() Экспорт

	Прокси = ПолучитьПрокси();

	ИдентификаторУстройства = Константы.ИдентификаторУстройства.Получить();
	КодУстройства = ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код;
	ХранилищеПолученныхДанных = Прокси.ОбновитьЦены(КодУстройства, ИдентификаторУстройства);
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ХранилищеПолученныхДанных.Получить());

		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель,ЧтениеСообщения.НомерПринятого);

		НачатьТранзакцию();
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
			
			Данные = ПрочитатьXML(ЧтениеXML);
			
			Если Не Данные = Неопределено Тогда
				
				Данные.ОбменДанными.Загрузка = Истина;
				Данные.Записать();
			
			КонецЕсли;
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		
		ЧтениеСообщения.ЗакончитьЧтение();
		ЧтениеXML.Закрыть();
		Сообщить("Оновлення цін успішно завершено!");
	Исключение
		Сообщить("Не вдалося виконати оновлення цін через причину: " + ОписаниеОшибки());
	КонецПопытки;

КонецФункции

Функция ОбновитьОстаткиНоменклатуры() Экспорт

	Прокси = ПолучитьПрокси();

	ИдентификаторУстройства = Константы.ИдентификаторУстройства.Получить();
	КодУстройства = ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код;
	ХранилищеПолученныхДанных = Прокси.ОбновитьОстатки(КодУстройства, ИдентификаторУстройства);
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ХранилищеПолученныхДанных.Получить());

		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель,ЧтениеСообщения.НомерПринятого);

		НачатьТранзакцию();
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
			
			Данные = ПрочитатьXML(ЧтениеXML);
			
			Если Не Данные = Неопределено Тогда
				
				Данные.ОбменДанными.Загрузка = Истина;
				Данные.Записать();
			
			КонецЕсли;
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		
		ЧтениеСообщения.ЗакончитьЧтение();
		ЧтениеXML.Закрыть();
		Сообщить("Оновлення залишків успішно завершено!");
	Исключение
		Сообщить("Не вдалося виконати оновлення залишків через причину: " + ОписаниеОшибки());
	КонецПопытки;

КонецФункции

Функция ПолучитьНовыйКлючСтроки(Знач ДокументОбъект, ИмяТЧ = "Товары") Экспорт

	МаксимальныйКлюч = 1;
	Если ДокументОбъект[ИмяТЧ].Количество() > 0 Тогда
		СписокКлючей = Новый СписокЗначений;
		СписокКлючей.ЗагрузитьЗначения(ДокументОбъект[ИмяТЧ].Выгрузить(, "КлючСтроки").ВыгрузитьКолонку("КлючСтроки"));
		СписокКлючей.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		МаксимальныйКлюч = СписокКлючей[0].Значение + 1;
	КонецЕсли;

	Возврат МаксимальныйКлюч;

КонецФункции

Процедура ОчиститьЛокальнуюБазуДанныхНаУстройстве() Экспорт

	Константы.ПользовательПоУмолчанию.Установить(Справочники.Пользователи.ПустаяСсылка());
	Константы.СкладПоУмолчанию.Установить(Справочники.Склады.ПустаяСсылка());
	Константы.ОрганизацияПоУмолчанию.Установить(Справочники.Организации.ПустаяСсылка());

	НаборЗаписей = РегистрыСведений.vrgОстаткиЗаказовПоставщикамМобильные.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	НаборЗаписей = РегистрыСведений.vrgОстаткиНаСкладахМобильныеСклад.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	НаборЗаписей = РегистрыСведений.vrgЦеныНоменклатурыМобильныеСклад.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();

	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст =
	"ВЫБРАТЬ
	|	ВидДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.vrgИнвентаризацияМобильная КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgТребованияНакладнаяМобыльный КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgПоступлениеМобильное КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgРасходныйОрдерМобильный КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgПриходныйОрдерМобильный КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgПеремещениеМобильное КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgРеализацияМобильная КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgВозвратМобильный КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgВозвратПоставщикуМобильный КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgСписаниеМобильное КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgЗаказПоставщикуМобильный КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgЗаказКлиентаМобильный КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgОприходованиеМобильное КАК ВидДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидДокументов.Ссылка
	|ИЗ
	|	Документ.vrgУниверсальныйДокументМобильный КАК ВидДокументов";
	Выборка = ЗапросДокументов.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Удалить();
	КонецЦикла;

	ЗапросСправочников = Новый Запрос;
	ЗапросСправочников.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕдиницыИзмерения.Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТипыЦенНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Склады.Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Области.Ссылка
	|ИЗ
	|	Справочник.Области КАК Области
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Районы.Ссылка
	|ИЗ
	|	Справочник.Районы КАК Районы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаселенныеПункты.Ссылка
	|ИЗ
	|	Справочник.НаселенныеПункты КАК НаселенныеПункты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Улицы.Ссылка
	|ИЗ
	|	Справочник.Улицы КАК Улицы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаправленияЗатрат.Ссылка
	|ИЗ
	|	Справочник.НаправленияЗатрат КАК НаправленияЗатрат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Подразделения.Ссылка
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатьиЗатрат.Ссылка
	|ИЗ
	|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат";
	
	ВыборкаСправочников = ЗапросСправочников.Выполнить().Выбрать();
	Пока ВыборкаСправочников.Следующий() Цикл
		СправочникОбъект = ВыборкаСправочников.Ссылка.ПолучитьОбъект();
		Если СправочникОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СправочникОбъект.Удалить();
	КонецЦикла;

	УзелЦентральнойБазы = Константы.УзелЦентральнойБазы.Получить();
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелЦентральнойБазы);
	Сообщить("Очищення локальної бази даних успішно завершено!");

КонецПроцедуры

Функция ПроверитьПарольПользователя(Пользователь, Пароль) Экспорт

	ТекстОшибки = "";
	Прокси = ПолучитьПрокси(Ложь, "Проверка пароля пользователя");
	Если Прокси = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	СтруктураОтвета = Прокси.ПроверитьПарольПользователя(ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код, СериализаторJSON(Пользователь), Пароль, ТекстОшибки);

	//НазваниеПроцедуры = "[Проверка пароля пользователя] ";
	//НазваниеПроцедуры = "";
	//Если ЗначениеЗаполнено(ТекстОшибки) Тогда
	//	Сообщить(НазваниеПроцедуры + ТекстОшибки);
	//	//Возврат Ложь;
	//КонецЕсли;

	Возврат ДесерилиазаторJSON(СтруктураОтвета);

КонецФункции

Процедура ПриЗаписиДокументаЗарегистрироватьИзмененияПриЗаписи(Источник, Отказ) Экспорт
	Регистировать = Истина;
	Если Источник.ОбменДанными.Загрузка Тогда
		Если Источник.ОбменДанными.Отправитель <> ПланыОбмена.vrgМобильныеСклад.ЭтотУзел() Тогда
			// Для узла, по которому пришли изменения, их регистрировать не нужно
			Регистировать = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	
	Если Регистировать Тогда 
		ПланыОбмена.ЗарегистрироватьИзменения(Константы.УзелЦентральнойБазы.Получить(), Источник.Ссылка);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьНоменклатуруПоШтрихкоду(Знач Штрихкод, ПолучитьСтруктуру = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("СокрЛПШтрихкод", СокрЛП(Штрихкод));
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Владелец КАК Номенклатура,
	|	Штрихкоды.Владелец.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА Штрихкоды.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА Штрихкоды.ЕдиницаИзмерения
	|		ИНАЧЕ Штрихкоды.Владелец.ЕдиницаХраненияОстатков
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Штрихкоды.ЕдиницаИзмерения.Коэффициент > 0
	|			ТОГДА Штрихкоды.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент,
	|	Штрихкоды.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Штрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод ПОДОБНО &СокрЛПШтрихкод
	|	ИЛИ Штрихкоды.Штрихкод ПОДОБНО &Штрихкод
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Если ПолучитьСтруктуру Тогда
		Выборка.Следующий();
		СтруктураНоменклатуры = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры, Выборка);
		Возврат СтруктураНоменклатуры;
	Иначе
		Возврат Выборка;
	КонецЕсли;

КонецФункции

Функция ПроверитьЕстьНоменклатураСерияВДокументах(Номенклатура,Серия) Экспорт
	
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vrgТребованияНакладнаяМобыльныйТовары.Ссылка КАК Ссылка,
		|	vrgТребованияНакладнаяМобыльныйТовары.Номенклатура КАК Номенклатура,
		|	vrgТребованияНакладнаяМобыльныйТовары.СерияНоменклатуры КАК СерияНоменклатуры
		|ИЗ
		|	Документ.vrgТребованияНакладнаяМобыльный.Товары КАК vrgТребованияНакладнаяМобыльныйТовары
		|ГДЕ
		|	vrgТребованияНакладнаяМобыльныйТовары.Номенклатура = &Номенклатура
		|	И vrgТребованияНакладнаяМобыльныйТовары.СерияНоменклатуры = &СерияНоменклатуры";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СерияНоменклатуры", Серия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Возврат  Истина;
		
	КонецЦикла;
	
	Возврат Ложь;
	
	
КонецФункции

Функция ЗапросПроверитьВерсию() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ТекущаяВерсия", Метаданные.Версия);
	Результат.Вставить("Узел", ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код);
	
	Параметры = Результат.Узел + "/" + Метаданные.Версия; 
	Параметры = СтрЗаменить(Параметры, ".", "_");
	HTTPСоединение = Новый HTTPСоединение("31.134.113.57", 80, "ryslanyakovlev_1", "7338108");                                 
	HTTPЗапрос = Новый HTTPЗапрос("Test_Vechir_1c_prog/en_US/hs/api/app-version/" + Параметры);
	//HTTPЗапрос = Новый HTTPЗапрос("VechirSrv1C/en_US/hs/api/app-version/" + Параметры);
	//HTTPЗапрос = Новый HTTPЗапрос("1C_Xatanet/en_US/hs/api/app-version/" + Параметры);
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);         
	
	СтрокаJson = Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаJson); 
	Данные = ПрочитатьJSON(ЧтениеJson,Истина);
	//Сообщить(СтрокаJson);
	Результат.Вставить("ВерсияНаСервере", СтрЗаменить(Данные["max_version"],"_","."));
	Результат.Успех = СтрЗаменить(Данные["max_version"],"_",".") = Метаданные.Версия;
	Возврат Результат;
КонецФункции

Функция ВерсияКлиентаОбновлена(Результат = Ложь, ТекУзел) Экспорт
	
	ТекУзел = ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код;
	Параметры = ТекУзел; 
	Параметры = СтрЗаменить(Параметры, ".", "_");
	Попытка                              	
		HTTPСоединение = Новый HTTPСоединение("31.134.113.57", 80, "ryslanyakovlev_1", "7338108");                                 
		HTTPЗапрос = Новый HTTPЗапрос("Test_Vechir_1c_prog/en_US/hs/api/client-version/" + Параметры);
		//HTTPЗапрос = Новый HTTPЗапрос("VechirSrv1C/en_US/hs/api/app-version/" + Параметры);
		//HTTPЗапрос = Новый HTTPЗапрос("1C_Xatanet/en_US/hs/api/app-version/" + Параметры);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);         
		
		СтрокаJson = Ответ.ПолучитьТелоКакСтроку();
		ЧтениеJson = Новый ЧтениеJSON;
		ЧтениеJson.УстановитьСтроку(СтрокаJson); 
		Данные = ПрочитатьJSON(ЧтениеJson,Истина);
		
		ВресияНаУзле 		= Данные["client_version"];
		ПоследняяВерсия 	= СтрЗаменить(Данные["max_version"], "_", ".");
		ВерсияМетаданных 	= Метаданные.Версия;
		
		Результат = ПоследняяВерсия = Метаданные.Версия;
	Исключение
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
